{"backend": "tensorflow", "keras_version": "2.2.4", "config": {"layers": [{"config": {"dtype": "float32", "bias_constraint": null, "use_bias": true, "units": 500, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 784], "name": "dense_1", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "sigmoid", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"bias_constraint": null, "use_bias": true, "units": 500, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "trainable": true, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "sigmoid", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"bias_constraint": null, "use_bias": true, "units": 10, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "trainable": true, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_3"}, "class_name": "Activation"}], "name": "sequential_1"}, "class_name": "Sequential"}