{"backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"units": 500, "bias_regularizer": null, "activation": "linear", "batch_input_shape": [null, 784], "name": "dense_1", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "dtype": "float32", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "sigmoid", "trainable": true}}, {"class_name": "Dense", "config": {"units": 500, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "name": "dense_2", "bias_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "sigmoid", "trainable": true}}, {"class_name": "Dense", "config": {"units": 10, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "name": "dense_3", "bias_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "softmax", "trainable": true}}]}}