{"keras_version": "2.2.4", "class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"trainable": true, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1, 1], "data_format": "channels_last", "dtype": "float32", "kernel_size": [3, 3], "batch_input_shape": [null, 28, 28, 1], "name": "conv2d_1", "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"trainable": true, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_size": [3, 3], "name": "conv2d_2", "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_2", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"trainable": true, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_size": [3, 3], "name": "conv2d_3", "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_3", "padding": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "activation": "linear", "name": "dense_1", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 200, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Dense", "config": {"trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "activation": "linear", "name": "dense_2", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "softmax"}}], "name": "sequential_1"}, "backend": "tensorflow"}